Revit 2027 API
PerformanceAdviser.WillRuleCheckElements(PerformanceAdviserRuleId) Method
 Reports if rule needs to be executed on individual elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool WillRuleCheckElements(
	PerformanceAdviserRuleId id
)
Public Function WillRuleCheckElements (
	id As PerformanceAdviserRuleId
) As Boolean
public:
bool WillRuleCheckElements(
	PerformanceAdviserRuleId^ id
)
member WillRuleCheckElements :
        id : PerformanceAdviserRuleId -> bool
Parameters
id PerformanceAdviserRuleId
 The rule id to get information for.
Return Value
Boolean
 True if rule needs to be executed on individual elements.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PerformanceAdviser Class
WillRuleCheckElements Overload
Autodesk.Revit.DB Namespace